; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(arm-empty)
(on-table b1)
(on b2 b10)
(on-table b3)
(on b4 b12)
(on b5 b7)
(on b6 b3)
(on-table b7)
(on b8 b5)
(on-table b9)
(on b10 b6)
(on b11 b4)
(on b12 b1)
(clear b2)
(clear b8)
(clear b9)
(clear b11)
)
(:goal
(and
(on b2 b4)
(on b5 b10)
(on b6 b2)
(on b7 b9)
(on b10 b12)
(on b11 b8))
)
)

; plan
1. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 0 of 6
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 6
3. (unstack b11 b4)
   deleted: (on b11 b4) (clear b11) (arm-empty)
   added: (holding b11) (clear b4)
   goals met: 0 of 6
4. (stack b11 b8)
   deleted: (clear b8) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b8)
   goals met: 1 of 6
5. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 1 of 6
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 6
7. (unstack b2 b10)
   deleted: (on b2 b10) (clear b2) (arm-empty)
   added: (holding b2) (clear b10)
   goals met: 1 of 6
8. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 2 of 6
9. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 2 of 6
10. (stack b10 b12)
   deleted: (clear b12) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b12)
   goals met: 3 of 6
11. (unstack b5 b7)
   deleted: (on b5 b7) (clear b5) (arm-empty)
   added: (holding b5) (clear b7)
   goals met: 3 of 6
12. (stack b5 b10)
   deleted: (clear b10) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b10)
   goals met: 4 of 6
13. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 6
14. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 5 of 6
15. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 5 of 6
16. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 6 of 6
